app/views/offerings/_form.html.erb

  <div class="selector">
	<%= f.label :teacher_ids, "teachers" %><br> <%= f.collection_select(:teacher_ids, Teacher.all.order(:aka), :id, :aka, {:prompt => "select one or more"}, {:multiple => true}) %>
---
SELECT "teachers".* FROM "teachers"  ORDER BY "teachers"."aka" ASC

  <div class="selector">
	<%= f.label :division_ids, "divisions" %><br> <%= f.collection_select(:division_ids, Division.all, :id, :div_number, {:prompt => "select one or more"}, {:multiple => true}) %>
---
SELECT "divisions".* FROM "divisions"

  <div class="lastselector">
	<%= f.label :grade_ids, "grades" %><br> <%= f.collection_select(:grade_ids, Grade.all, :id, :grade_level, {:prompt => "select one or more"}, {:multiple => true}) %>
---
SELECT "grades".* FROM "grades"