app/views/students/_form.html.erb


  <% if @student.member.errors.any? %>
---
SELECT  "members".* FROM "members" WHERE "members"."student_id" = ? LIMIT 1  [["student_id", 2]]