app/views/divisions/_form.html.erb

SELECT "grades".id FROM "grades" WHERE "grades"."division_id" = ?  [["division_id", 2]]
---
  <p>
	<%= f.label :Grade_ids, "grades" %><br> <%= f.collection_select(:grade_ids, Grade.all.order(:id), :id, :grade_level, {:prompt => "select one or more"}, {:multiple => true}) %>