app/views/welcome/teacher.html.erb

SELECT "offerings".* FROM "offerings" INNER JOIN "offerings_teachers" ON "offerings"."id" = "offerings_teachers"."offering_id" WHERE "offerings_teachers"."teacher_id" = ?  [["teacher_id", 13]]
---
<tbody>
<% @teacher.offerings.each do |offering| %>