app/views/teachers/_form.html.erb

SELECT  "members".* FROM "members" WHERE "members"."teacher_id" = ? LIMIT 1  [["teacher_id", 2]]
---

  <% if @teacher.member.errors.any? %>