app/views/parents/_form.html.erb


  <% if @parent.member.errors.any? %>
---
SELECT  "members".* FROM "members" WHERE "members"."parent_id" = ? LIMIT 1  [["parent_id", 2]]