app/controllers/divisions_controller.rb

	def index
		@divisions = Division.all
---
SELECT "divisions".* FROM "divisions"

	def show
		@division = Division.find(params[:id])
---
SELECT  "divisions".* FROM "divisions" WHERE "divisions"."id" = ? LIMIT 1  [["id", 1]]

	def edit
		@division = Division.find(params[:id])
---
SELECT  "divisions".* FROM "divisions" WHERE "divisions"."id" = ? LIMIT 1  [["id", 2]]

	def create
		@division = Division.new(division_params)
        @division.grade_ids = params[:division][:grade_ids]

		if @division.save
---
INSERT INTO "divisions" ("div_number", "created_at", "updated_at") VALUES (?, ?, ?)  [["div_number", 1], ["created_at", "2015-07-06 17:17:04.542754"], ["updated_at", "2015-07-06 17:17:04.542754"]]

	def update
		@division = Division.find(params[:id])
        @division.grade_ids = params[:division][:grade_ids]

        if @division.update(division_params)
---
SELECT  "divisions".* FROM "divisions" WHERE "divisions"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "grades" SET "division_id" = ?, "updated_at" = ? WHERE "grades"."id" = ?  [["division_id", 1], ["updated_at", "2015-08-19 19:35:48.060495"], ["id", 1]]

  def destroy
    @division = Division.find(params[:id])
    @division.destroy
---
SELECT  "divisions".* FROM "divisions" WHERE "divisions"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "divisions" WHERE "divisions"."id" = ?  [["id", 1]]