app/controllers/grades_controller.rb

SELECT "grades".* FROM "grades"
---
	def index
		@grades = Grade.all

SELECT  "grades".* FROM "grades" WHERE "grades"."id" = ? LIMIT 1  [["id", 1]]
---
	def show
		@grade = Grade.find(params[:id])

SELECT  "grades".* FROM "grades" WHERE "grades"."id" = ? LIMIT 1  [["id", 1]]
---
	def edit
		@grade = Grade.find(params[:id])

INSERT INTO "grades" ("grade_level", "created_at", "updated_at") VALUES (?, ?, ?)  [["grade_level", "K"], ["created_at", "2015-07-06 17:17:16.810353"], ["updated_at", "2015-07-06 17:17:16.810353"]]
---
	def create
		@grade = Grade.new(grade_params)

		if @grade.save

SELECT  "grades".* FROM "grades" WHERE "grades"."id" = ? LIMIT 1  [["id", 1]]
---
	def update
		@grade = Grade.find(params[:id])

SELECT  "grades".* FROM "grades" WHERE "grades"."id" = ? LIMIT 1  [["id", 8]]
DELETE FROM "grades" WHERE "grades"."id" = ?  [["id", 8]]
---
	def destroy
		@grade = Grade.find(params[:id])
		@grade.destroy