app/controllers/login_controller.rb

SELECT  "members".* FROM "members" WHERE "members"."name" = ? LIMIT 1  [["name", "pete"]]
SELECT  "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT 1  [["id", 13]]
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
---
  def login
    session[:member_id] = nil
    if request.get?
      @member = Member.new
      respond_to do |format|
        format.html # new.html.erb
        format.xml  { render :xml => @member }
      end
    else
      @member = Member.identify(params[:member][:name], params[:member][:password])
      if @member
        session[:member_id] = @member.id
        after_login = session[:after_login] || '/'
        session[:after_login] = nil
        if @member.teacher.present?
          after_login = '/teacher' unless after_login =~ /teacher/
        elsif @member.student.present?