app/controllers/members_controller.rb

  def index
    @members = Member.all().select{|m| m.admin? }
---
SELECT "members".* FROM "members"

  def password
    @member = Member.find(params[:id])
---
SELECT  "members".* FROM "members" WHERE "members"."id" = ? LIMIT 1  [["id", 3]]

  def create
    @member = Member.new(member_params)

    respond_to do |format|
      if @member.save
---
INSERT INTO "members" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "pete"], ["created_at", "2015-07-20 23:25:33.218469"], ["updated_at", "2015-07-20 23:25:33.218469"]]

  def update
    begin
      @member = Member.find(params[:id])
    rescue ActiveRecord::RecordNotFound
       @link = Member.new(params[:member])
      flash[:notice] = "Record not found, presumed deleted by another user, can recreate it"
      render :action => "new"
      return
    end
    respond_to do |format|
      if @member.update_attributes(member_params)
---
SELECT  "members".* FROM "members" WHERE "members"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "members" SET "salt" = ?, "hashed_password" = ?, "updated_at" = ? WHERE "members"."id" = ?  [["salt", "random0.8336119103804431"], ["hashed_password", "100e101860732b2b84e667f1ab8690116cfbaec7"], ["updated_at", "2015-07-27 23:16:18.510536"], ["id", 1]]

  def destroy
    begin
      @member = Member.find(params[:id])
      @member.destroy
---
SELECT  "members".* FROM "members" WHERE "members"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "members" WHERE "members"."id" = ?  [["id", 2]]