app/controllers/offerings_controller.rb

  def index
    @offerings = Offering.all
---
SELECT "offerings".* FROM "offerings"

  def show
    @offering = Offering.find(params[:id])
---
SELECT  "offerings".* FROM "offerings" WHERE "offerings"."id" = ? LIMIT 1  [["id", 1]]

  def edit
    @offering = Offering.find(params[:id])
---
SELECT  "offerings".* FROM "offerings" WHERE "offerings"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @offering = Offering.new(offering_params)
    @offering.teacher_ids = params[:offering][:teacher_ids]
    @offering.division_ids = params[:offering][:division_ids]
    @offering.grade_ids = (params[:offering][:grade_ids]).reject!{|gid|
      "".eql?(gid) ? true : @offering.division_ids.include?(Grade.find(gid).division_id) }

    if @offering.save
---
SELECT  "grades".* FROM "grades" WHERE "grades"."id" = ? LIMIT 1  [["id", 12]]
SELECT  "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT 1  [["id", 1]]
SELECT "divisions".* FROM "divisions" WHERE "divisions"."id" IN (1, 2)
INSERT INTO "offerings" ("title", "short_desc", "long_desc", "div_num", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "tets"], ["short_desc", "testigb"], ["long_desc", "long testing"], ["div_num", "K"], ["created_at", "2015-07-16 19:20:43.100160"], ["updated_at", "2015-07-16 19:20:43.100160"]]

  def update
    @offering = Offering.find(params[:id])
    @offering.teacher_ids = params[:offering][:teacher_ids]
    @offering.division_ids = params[:offering][:division_ids]
    @offering.grade_ids = (params[:offering][:grade_ids]).reject!{|gid|
      "".eql?(gid) ? true : @offering.division_ids.include?(Grade.find(gid).division_id) }

    if @offering.update(offering_params)
---
SELECT  "offerings".* FROM "offerings" WHERE "offerings"."id" = ? LIMIT 1  [["id", 1]]
SELECT "divisions".* FROM "divisions" INNER JOIN "divisions_offerings" ON "divisions"."id" = "divisions_offerings"."division_id" WHERE "divisions_offerings"."offering_id" = ?  [["offering_id", 1]]
SELECT "grades".* FROM "grades" INNER JOIN "grades_offerings" ON "grades"."id" = "grades_offerings"."grade_id" WHERE "grades_offerings"."offering_id" = ?  [["offering_id", 1]]
SELECT "teachers".* FROM "teachers" INNER JOIN "offerings_teachers" ON "teachers"."id" = "offerings_teachers"."teacher_id" WHERE "offerings_teachers"."offering_id" = ?  [["offering_id", 4]]
UPDATE "offerings" SET "long_desc" = ?, "updated_at" = ? WHERE "offerings"."id" = ?  [["long_desc", "test long desc should show"], ["updated_at", "2015-08-18 20:34:55.988797"], ["id", 1]]

  def destroy
    @offering = Offering.find(params[:id])
    @offering.destroy
---
SELECT  "offerings".* FROM "offerings" WHERE "offerings"."id" = ? LIMIT 1  [["id", 3]]
DELETE FROM "offerings" WHERE "offerings"."id" = ?  [["id", 3]]