app/controllers/parents_controller.rb

  def index
	  @parents = Parent.all
---
SELECT "parents".* FROM "parents"

  def update
	  @parent = Parent.find(params[:id])
    if @parent.member.nil?
      @parent.build_member(member_params)
    end
    if @parent.update(parent_params) && @parent.member.errors.none?
---
SELECT  "parents".* FROM "parents" WHERE "parents"."id" = ? LIMIT 1  [["id", 4]]
SELECT  "members".* FROM "members" WHERE "members"."parent_id" = ? LIMIT 1  [["parent_id", 4]]
UPDATE "parents" SET "last_name" = ?, "updated_at" = ? WHERE "parents"."id" = ?  [["last_name", "mrss"], ["updated_at", "2015-08-14 21:05:15.385879"], ["id", 4]]

  def show
	@parent = Parent.find(params[:id])
---
SELECT  "parents".* FROM "parents" WHERE "parents"."id" = ? LIMIT 1  [["id", 1]]

  def edit
	  @parent = Parent.find(params[:id])
---
SELECT  "parents".* FROM "parents" WHERE "parents"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @parent = Parent.new(parent_params)
    @parent.build_member(member_params)
	  if @parent.save && @parent.member.errors.none?
---
INSERT INTO "members" ("name", "parent_id", "salt", "hashed_password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
INSERT INTO "parents" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "one"], ["last_name", "two"], ["created_at", "2015-07-28 19:20:05.064644"], ["updated_at", "2015-07-28 19:20:05.064644"]]
SELECT  "members".* FROM "members" WHERE "members"."parent_id" = ? LIMIT 1  [["parent_id", 2]]

  def destroy
	@parent = Parent.find(params[:id])
	@parent.destroy
---
SELECT  "parents".* FROM "parents" WHERE "parents"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "parents" WHERE "parents"."id" = ?  [["id", 2]]