app/controllers/students_controller.rb

  def create
    @student = Student.new(student_params)
    @student.build_member(member_params)
    if @student.save && @student.member.errors.none?
---
INSERT INTO "members" ("name", "student_id", "salt", "hashed_password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "test"], ["last_name", "test"], ["created_at", "2015-08-12 22:08:26.095034"], ["updated_at", "2015-08-12 22:08:26.095034"]]
SELECT  "members".* FROM "members" WHERE "members"."id" = ? LIMIT 1  [["id", 6]]

  def update
    @student = Student.find(params[:id])
    if @student.member.nil?
      @student.build_member(member_params)
    end
    if @student.update(student_params) && @student.member.errors.none?
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "members".* FROM "members" WHERE "members"."student_id" = ? LIMIT 1  [["student_id", 2]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "tester"], ["last_name", "tester"], ["updated_at", "2015-08-13 17:03:54.928911"], ["id", 2]]