app/controllers/teachers_controller.rb

  def create
    @teacher = Teacher.new(teacher_params)
    @teacher.build_member(member_params)
    if @teacher.save && @teacher.member.errors.none?
---
INSERT INTO "members" ("name", "teacher_id", "salt", "hashed_password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
INSERT INTO "teachers" ("firstname", "lastname", "title", "aka", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["firstname", "Moche"], ["lastname", "Renert"], ["title", "Dr"], ["aka", "Moses"], ["created_at", "2015-07-16 20:04:17.802632"], ["updated_at", "2015-07-16 20:04:17.802632"]]
SELECT  "members".* FROM "members" WHERE "members"."teacher_id" = ? LIMIT 1  [["teacher_id", 8]]

  def update
    @teacher = Teacher.find(params[:id])
    if @teacher.member.nil?
      @teacher.build_member(member_params)
    end
    if @teacher.update(teacher_params) && @teacher.member.errors.none?
---
SELECT  "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "members".* FROM "members" WHERE "members"."teacher_id" = ? LIMIT 1  [["teacher_id", 2]]
UPDATE "members" SET "teacher_id" = ?, "updated_at" = ? WHERE "members"."id" = ?  [["teacher_id", nil], ["updated_at", "2015-07-27 21:35:18.448781"], ["id", 2]]
UPDATE "teachers" SET "title" = ?, "aka" = ?, "updated_at" = ? WHERE "teachers"."id" = ?  [["title", "aaq"], ["aka", "aaq"], ["updated_at", "2015-08-12 21:50:40.675623"], ["id", 22]]

  def edit
    @teacher = Teacher.find(params[:id])
---
SELECT  "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT 1  [["id", 1]]

  def destroy
    @teacher = Teacher.find(params[:id])
    @teacher.destroy
---
SELECT  "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "teachers" WHERE "teachers"."id" = ?  [["id", 2]]